{
  "backend/main.mo": "Defines actor with storage and authorization mixins plus types and comparison modules for users, slots, gigs, transactions, ROI data, and analytics events.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Lists short summaries for all major frontend components, hooks, pages, and utilities used across the app.",
  "frontend/index.css": "Tailwind base file defining OKLCH color variables, theme modes, and global styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup, admin routing, and role‑based dashboards with usage tracking.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an admin‑only access denied message with a go‑back button.",
  "frontend/src/components/AvailabilityCalendar.tsx": "Musician availability manager allowing creation and toggling of time slots with UI sorting and mutations.",
  "frontend/src/components/BookingDialog.tsx": "Venue booking modal that submits gig details and creates a confirmed gig for a musician.",
  "frontend/src/components/Header.tsx": "Renders the site header with branding, user avatar, admin link, and logout handling using identity and profile queries.",
  "frontend/src/components/MusicianSearch.tsx": "Provides a searchable list of musicians with filtering, profile previews, and booking callbacks.",
  "frontend/src/components/ProfileSetup.tsx": "Displays a profile creation form that saves user details and selected role, validating inputs and integrating with Internet Identity.",
  "frontend/src/components/QRScannerDialog.tsx": "Opens a dialog to scan QR codes for gig verification, triggering attendance checks and handling scanning states.",
  "frontend/src/components/QRTicketGenerator.tsx": "Generates downloadable QR-like tickets for gigs using a custom canvas-based pattern generator.",
  "frontend/src/components/WalletView.tsx": "Shows wallet earnings across locked, available, and paid balances with a summary and breakdown cards.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating profiles, gigs, musicians, analytics, and usage events through the actor.",
  "frontend/src/hooks/useUsageTracking.ts": "Tracks session, page views, and actions for authenticated users by recording usage events once per session.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, theming for light and dark modes, and base typography rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard displaying analytics summaries and recent usage events with loading and error states.",
  "frontend/src/pages/CustomerDashboard.tsx": "Customer dashboard showing user-specific data and searchable, upcoming gig listings with a styled UI.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing hero content, gig search, and login actions by role with filtering for upcoming gigs.",
  "frontend/src/pages/MusicianDashboard.tsx": "Musician dashboard displaying profile info, stats, upcoming gigs, wallet data, and availability management.",
  "frontend/src/pages/VenueDashboard.tsx": "Venue dashboard showing venue stats, gig lists, musician search, booking flow, and QR scanning.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layout, animations, and plugins for typography, containers, and animations.",
  "project_state.json": "Project state metadata describing app features, issues, and analytics/admin dashboard requirements."
}