{
  "backend/main.mo": "Defines core actor logic with user profiles, slots, gigs, transactions, ROI data, and comparison helpers, integrating authorization and blob storage mixins.",
  "feature_evidence.json": "Lists feature implementation evidence referencing frontend files, components, and test IDs for tracking, admin dashboard, navigation, and analytics.",
  "frontend-file-summaries.txt": "Provides short descriptions of major frontend components, pages, hooks, and styles for documentation or analysis.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark mode with custom OKLCH color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling auth, profile loading, minimal routing including /admin, and automatic page-view tracking.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when a non-admin user attempts to access restricted admin pages.",
  "frontend/src/components/AvailabilityCalendar.tsx": "Musician availability calendar allowing slot creation and availability toggling with sorted display.",
  "frontend/src/components/BookingDialog.tsx": "Dialog for venues to book a musician by submitting event name, date, and price, then calling the bookGig mutation.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing branding, user avatar menu, admin link, and logout handling using Internet Identity.",
  "frontend/src/components/MusicianSearch.tsx": "Search UI that filters musicians by name, location, or bio and displays cards with booking actions.",
  "frontend/src/components/ProfileSetup.tsx": "Form for new users to create and save a profile including name, phone, location, bio, and role selection.",
  "frontend/src/components/QRScannerDialog.tsx": "Dialog with live camera scanning to validate musician QR tickets and verify gig attendance.",
  "frontend/src/components/QRTicketGenerator.tsx": "Generates and downloads simple QR-code-like images for each confirmed gig using a custom canvas renderer.",
  "frontend/src/components/WalletView.tsx": "Displays wallet totals and breakdown of locked, available, and paid funds using styled cards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity authentication and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, logout, and identity management for the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating profiles, musicians, gigs, analytics, and usage events via the backend actor.",
  "frontend/src/hooks/useUsageTracking.ts": "Tracks session start, page views, and user actions by recording usage events when authenticated.",
  "frontend/src/index.css": "Sets global Tailwind styles, CSS variables for light/dark themes, and base typography.",
  "frontend/src/main.tsx": "Bootstraps the app with React, InternetIdentityProvider, and React Query client.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders analytics dashboard showing KPIs and usage events with loading and error states.",
  "frontend/src/pages/CustomerDashboard.tsx": "Displays customer-facing event search and upcoming gigs using user profile and gig data.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with login buttons, hero section, search, and a preview of upcoming gigs.",
  "frontend/src/pages/MusicianDashboard.tsx": "Dashboard for musicians showing upcoming gigs, earnings, availability, and related management tools.",
  "frontend/src/pages/VenueDashboard.tsx": "Dashboard for venues with gig stats, musician search, booking, and QR-based verification tools.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and enabling typography and query plugins.",
  "project_state.json": "JSON file describing current project state, including schema version, app analytics goals, admin dashboard requirements, existing features, and pending feature requests. It also lists architectural notes and known implementation issues."
}