{
  "backend/main.mo": "Defines core backend types and comparison modules for users, slots, gigs, transactions, ROI data, and usage events, integrating authorization and blob storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping specific user-facing features to related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries for all major frontend files, describing their purpose and key functionality.",
  "frontend/index.css": "Sets Tailwind base layers and custom CSS variables for light and dark themes using an OKLCH color system.",
  "frontend/index.html": "HTML entry point that loads the root React element and bootstraps the application via main.tsx.",
  "frontend/src/App.tsx": "Main React app that handles authentication flow, profile setup, admin gating, usage tracking, and routing to role‑based dashboards.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays a styled access-denied message for non-admin users with a button to navigate back.",
  "frontend/src/components/AvailabilityCalendar.tsx": "Renders and manages musician availability slots, allowing creation and toggling availability with backend mutations.",
  "frontend/src/components/BookingDialog.tsx": "Dialog for creating and submitting gig bookings, validating form data and triggering the bookGig mutation.",
  "frontend/src/components/Header.tsx": "Header displaying branding, admin shortcut, and user dropdown with logout and profile info.",
  "frontend/src/components/MusicianSearch.tsx": "Search interface filtering musicians by text input and allowing booking actions.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form allowing users to set personal details and role, then saving via saveProfile mutation.",
  "frontend/src/components/QRScannerDialog.tsx": "Dialog that activates a camera scanner to verify gig attendance by matching QR codes, triggering verifyGig on success.",
  "frontend/src/components/QRTicketGenerator.tsx": "Generates and downloads QR code images for confirmed gigs using a custom canvas-based QR generator.",
  "frontend/src/components/WalletView.tsx": "Displays wallet totals and breakdown of locked, available, and paid earnings using styled cards.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading, login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, musicians, gigs, analytics, and usage events.",
  "frontend/src/hooks/useUsageTracking.ts": "Tracks session start, page views, and user actions by recording usage events when authenticated.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables for UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders analytics summary and recent usage events with loading, error handling, and KPI cards.",
  "frontend/src/pages/CustomerDashboard.tsx": "Customer dashboard that fetches user profile and gigs, filters upcoming events, and displays them with a search bar and event cards.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with login flow, role selection, hero section, and a preview list of upcoming gigs with search.",
  "frontend/src/pages/MusicianDashboard.tsx": "Musician dashboard showing stats, upcoming/confirmed gigs, wallet data, slots, and tabbed tools like calendar and QR ticket generation.",
  "frontend/src/pages/VenueDashboard.tsx": "Venue dashboard to manage venue gigs, browse musicians, book artists, and scan QR tickets, with stats and tabbed sections.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Defines the project's current state, including analytics/dashboard features, known implementation issues, and a list of existing feature requirements around tracking, admin UI, minimal routing, query hooks, and role‑based login."
}