{
  "backend/main.mo": "Defines core actor logic with mixin-based storage and authorization plus types and comparison modules for users, slots, gigs, transactions, ROI data, and usage analytics.",
  "feature_evidence.json": "Feature evidence report mapping UX/design features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all major frontend components, pages, hooks, and styling files.",
  "frontend/index.css": "Tailwind base and CSS variable definitions implementing OKLCH Cyber‑Noir color tokens and dark/light theme variables.",
  "frontend/index.html": "HTML entrypoint setting favicon, metadata, root div, and loading the main React bundle.",
  "frontend/src/App.tsx": "Main React app handling authentication, role-based routing, admin access checks, profile setup, and page‑view tracking.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple admin‑only access denial screen with icon, message, and back button.",
  "frontend/src/components/AvailabilityCalendar.tsx": "Musician availability manager allowing slot creation and availability toggling with UI cards and sorting.",
  "frontend/src/components/BookingDialog.tsx": "Provides a dialog for venues to enter event details and submit a gig booking for a musician using form state and mutation hooks.",
  "frontend/src/components/Header.tsx": "Renders the site header with branding, user profile dropdown, admin access button, and logout handling.",
  "frontend/src/components/MusicianSearch.tsx": "Displays a searchable list of musicians and lets users filter and initiate booking actions from each musician card.",
  "frontend/src/components/ProfileSetup.tsx": "Handles initial user profile creation with role selection, form inputs, validation, and profile submission.",
  "frontend/src/components/QRScannerDialog.tsx": "Opens a dialog that activates a camera-based QR scanner to verify musician attendance for a gig.",
  "frontend/src/components/QRTicketGenerator.tsx": "Generates and downloads simple QR-code-like images for confirmed gigs using a canvas-based pattern generator.",
  "frontend/src/components/WalletView.tsx": "Displays wallet totals and breakdown of locked, available, and paid amounts using styled cards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, musicians, gigs, analytics, and usage events using the backend actor.",
  "frontend/src/hooks/useUsageTracking.ts": "Records session, page view, and action analytics events when the user is authenticated.",
  "frontend/src/index.css": "Sets Tailwind CSS base styles, custom CSS variables, dark mode theme, and utility glow effects.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders admin analytics dashboard with KPI cards and usage event table, handling loading and error states.",
  "frontend/src/pages/CustomerDashboard.tsx": "Fetches user profile and gigs, filters upcoming events by search, and displays them in a card grid.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with login flow, hero section, and search-filtered upcoming gigs preview.",
  "frontend/src/pages/MusicianDashboard.tsx": "Musician dashboard showing gig stats, wallet info, availability management, and tabs for gigs, calendar, and QR tools.",
  "frontend/src/pages/VenueDashboard.tsx": "Venue dashboard for managing gigs, booking musicians, viewing stats, and scanning QR codes for events.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters with hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, radii, fonts, shadows, and keyframes, plus plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing analytics features, Cyber‑Noir UI goals, known issues, required image assets, and existing feature definitions."
}