{
  "kind": "build_request",
  "title": "Add complete Jest + React Testing Library /tests folder",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Create a complete repository-root `/tests` folder containing a working automated frontend test suite for the existing React app, using Jest + React Testing Library, with test files covering: LandingPage role-based login buttons, App authentication gating, App minimal path-based routing for `/admin` (admin vs non-admin), role-based dashboard rendering (venue/musician/customer), ProfileSetup rendering for authenticated users without a profile, and usage tracking behavior (page_view on mount when authenticated, session_start once per session).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "A complete /tests folderJust"
        ]
      },
      "acceptanceCriteria": [
        "A `/tests` directory exists at the repository root and contains all test code (test files + any test utilities/mocks).",
        "Tests include coverage for: LandingPage role buttons (Venue/Musician/Customer) calling role selection and triggering login; App renders LandingPage when unauthenticated; App renders ProfileSetup when authenticated and userProfile is null; App renders AdminDashboard at `/admin` for admin users and AccessDeniedScreen for non-admin users; App renders correct role dashboard based on `userProfile.role`; usage tracking calls trackPageView on mount when authenticated and does not run when unauthenticated.",
        "All tests can be executed in a JS DOM environment and do not require a running Internet Computer canister or network connectivity."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Add test harness utilities inside `/tests` to make component tests deterministic: a shared render helper that wraps components with required providers (e.g., React Query provider), plus module mocks for Internet Identity and backend-query hooks so tests can simulate authentication states, admin state, and backend data without editing the immutable hook source files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "A complete /tests folderJust"
        ]
      },
      "acceptanceCriteria": [
        "`/tests` includes reusable helpers (e.g., a `renderWithProviders` utility) that can render `App` and pages without runtime errors.",
        "Tests mock `useInternetIdentity`, `useGetCallerUserProfile`, `useIsCallerAdmin`, and usage tracking/recording paths so that each authentication/admin scenario can be simulated.",
        "No changes are required to any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, or `frontend/src/components/ui` to enable testing."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Include a minimal, developer-friendly testing README inside `/tests` that explains how to run the test suite locally and what the suite covers, using English for all user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "A complete /tests folderJust"
        ]
      },
      "acceptanceCriteria": [
        "`/tests/README.md` exists and explains: how to run tests, what is mocked, and which high-level modules are covered (LandingPage, App routing/auth gating, admin gating, dashboards, usage tracking)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any frontend files under the immutable paths listed by the platform (including `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`).",
    "Keep backend unchanged for this request; the `/tests` suite must mock backend interactions rather than requiring new Motoko endpoints."
  ],
  "nonGoals": [
    "Investigating or fixing the reported slow initial load performance (can be handled in a separate request).",
    "Adding end-to-end (E2E) browser automation (e.g., Playwright/Cypress).",
    "Adding backend (Motoko) unit tests."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}