{
  "kind": "build_request",
  "title": "Simplified built-in usage analytics + admin dashboard for Encoreats",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add built-in usage analytics storage and APIs in `backend/main.mo` to track app usage without third-party services. At minimum, store: (a) total unique users (principals), (b) total sessions, (c) per-day active users counts for the last N days, and (d) last-active timestamp per user.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create my admin panel to how many people use my app",
          "Pro admin dashboard Includes charts, graphs, daily usage trends, and logs.",
          "ok continue"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes update/query methods that allow the frontend to record a user activity event and to fetch aggregated analytics.",
        "Analytics includes: unique user count, session count, daily active users by day, and per-user last active time.",
        "Recording an event updates last-active for the caller and increments the appropriate aggregates.",
        "All analytics data is stored on-canister (no external services)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement an append-only usage log in `backend/main.mo` and a query API that returns a paginated slice of recent events for display in the admin dashboard. Each event must include timestamp, caller principal, and a simple event type (e.g., session_start, page_view).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Pro admin dashboard Includes charts, graphs, daily usage trends, and logs."
        ]
      },
      "acceptanceCriteria": [
        "Backend provides a query method to fetch recent log entries with pagination parameters (e.g., offset/limit) and returns results in reverse-chronological order.",
        "Log entries include: timestamp, principal, and event type (and optionally path if available).",
        "Non-admin callers cannot fetch logs (must be restricted)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add admin-only backend APIs in `backend/main.mo` to fetch the aggregated analytics summary and trends needed by the dashboard, and enforce access control using the existing authorization system (only admin principals can access admin analytics/log endpoints).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "A `/admin` page inside your app",
          "A password gate so only you can enter",
          "Pro admin dashboard Includes charts, graphs, daily usage trends, and logs."
        ]
      },
      "acceptanceCriteria": [
        "Non-admin callers receive an authorization error when calling admin analytics/log query methods.",
        "Admin callers can fetch analytics summary and trend data successfully.",
        "Authorization uses the existing `AccessControl.isAdmin(accessControlState, caller)` pattern already present in the canister."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add frontend tracking that automatically records usage events to the backend: record a `session_start` when an authenticated user enters the app and record `page_view` (or equivalent) for the currently rendered screen. Ensure the tracking calls do not block UI rendering and gracefully no-op when the actor/identity is unavailable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Automatic tracking (no user action needed)"
        ]
      },
      "acceptanceCriteria": [
        "When a user is authenticated, at least one backend tracking call is made per app visit (session_start).",
        "Tracking does not throw uncaught errors if the actor is not ready; the app remains usable.",
        "Tracking is implemented using existing React Query/actor patterns (e.g., via `useActor()` and a small mutation/helper)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Create a simplified `/admin` admin dashboard UI page (new React page component under `frontend/src/pages/`) that shows: total unique users, total sessions, daily active users trend (last N days), and a scrollable recent activity log table. Use existing shadcn UI components and Tailwind styling consistent with the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "A `/admin` page inside your app",
          "Pro admin dashboard Includes charts, graphs, daily usage trends, and logs."
        ]
      },
      "acceptanceCriteria": [
        "Admin dashboard displays numeric KPI cards for unique users and sessions.",
        "Admin dashboard displays a daily active users trend visualization (simple chart or bar list is acceptable).",
        "Admin dashboard displays recent logs in a table/list with timestamp and principal at minimum.",
        "Loading, empty-state, and error states are handled with user-facing English text."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add navigation/entry to the admin dashboard without introducing a full routing framework: implement minimal path-based rendering so that visiting `/admin` renders the admin dashboard instead of the role dashboard. If the current user is not an admin, show an 'Access denied' screen for `/admin`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "A `/admin` page inside your app",
          "ok continue"
        ]
      },
      "acceptanceCriteria": [
        "When the browser path is `/admin`, the admin dashboard component is rendered.",
        "Non-admin authenticated users visiting `/admin` see an access denied message and do not see analytics/log data.",
        "Authenticated admin users visiting `/admin` can see analytics/log data.",
        "No changes are made to immutable paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add React Query hooks in `frontend/src/hooks/useQueries.ts` (or a new hooks file if needed) to call the new backend analytics endpoints: (1) fetch admin analytics summary, (2) fetch daily active trend, (3) fetch paginated logs, and (4) record tracking events.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create my admin panel to how many people use my app"
        ]
      },
      "acceptanceCriteria": [
        "Hooks follow existing conventions in `useQueries.ts` (useActor + enabled flags).",
        "Admin dashboard uses these hooks rather than calling the actor directly in components.",
        "Queries are properly keyed and can be refetched (e.g., after pagination change)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; do not introduce additional backend services.",
    "Do not edit files under `frontend/src/components/ui` or any `frontend.immutablePaths` files listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing UI text.",
    "No third-party analytics integrations (Cloudflare/Umami/Plausible) in this implementation."
  ],
  "nonGoals": [
    "Implementing a full-featured router (e.g., React Router) across the entire app.",
    "Collecting personally identifying analytics beyond principal, timestamps, and simple event metadata.",
    "Geo/location analytics, device fingerprinting, or cross-site tracking.",
    "External database or off-canister storage for analytics."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}