{
  "kind": "build_request",
  "title": "Add role selection at login for musician, customer, and venue",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Add an explicit role selection step to the login experience so a user can choose to continue as \"Venue\", \"Musician\", or \"Customer\" before authenticating, and ensure the selected role is carried into profile creation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Give me a login option for musician:consumer:venue"
        ]
      },
      "acceptanceCriteria": [
        "On the public Landing page, the user can choose one of three options: Venue, Musician, Customer, with clear English labels.",
        "Choosing a role and then logging in persists the selected role for the current browser session (e.g., via sessionStorage) so it survives the Internet Identity redirect/roundtrip.",
        "If the authenticated user has no profile yet and is sent to Profile Setup, the role field is pre-selected to the role chosen on the Landing page.",
        "If no role was selected before login, Profile Setup defaults to the current existing default behavior (musician).",
        "The change does not require editing any files under the frontend immutable paths list (e.g., do not edit `frontend/src/hooks/useInternetIdentity.ts`)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update the Landing page call-to-action buttons to provide three distinct \"Continue as\" / \"Join as\" login options (Venue, Musician, Customer) while continuing to use Internet Identity for authentication.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Give me a login option for musician:consumer:venue"
        ]
      },
      "acceptanceCriteria": [
        "Landing page shows three role-specific login buttons (Venue, Musician, Customer).",
        "Clicking any of the three buttons initiates the existing Internet Identity login flow.",
        "Buttons show an appropriate disabled/loading state when login is in progress, consistent with the current UI behavior.",
        "All user-facing text for these buttons is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor; do not introduce additional backend services.",
    "Do not edit files listed in `frontend.immutablePaths` in SYSTEM_CONTEXT; compose new logic in other files instead.",
    "Do not introduce a full routing framework; keep the existing minimal path-based rendering approach."
  ],
  "nonGoals": [
    "Implementing phone number login or OTP flows.",
    "Allowing a single Internet Identity principal to maintain multiple simultaneous roles/accounts.",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Changing the existing admin (/admin) access control behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}