{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Cyber‑Noir Landing Page Hero + nightlife brand assets",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Redesign Landing Page hero to full-bleed jazz-band background with ~60% dark overlay and a neon gradient “Book Now” CTA.",
      "acceptanceCriteria": [
        "Landing page hero uses a jazz-band background image rendered from a static asset under frontend/public/assets/generated/.",
        "A dark overlay approximating 60% black opacity is visible on top of the hero background image.",
        "Hero headline text remains present and readable in English on dark background.",
        "Primary CTA button text reads exactly “Book Now” and uses a purple→pink neon gradient styling (Tailwind gradient classes acceptable).",
        "Hero section renders correctly on mobile and desktop breakpoints without horizontal overflow."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/hero_jazz_band_bg.dim_2400x1350.jpg",
          "operation": "create",
          "description": "Add the required hero background image as a static frontend asset (no backend involvement)."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Replace the current hero section with a full-bleed background using frontend/public/assets/generated/hero_jazz_band_bg.dim_2400x1350.jpg, add an overlay layer approximating 60% black opacity, ensure English hero text remains readable, and implement a primary gradient CTA button labeled exactly “Book Now” with responsive layout to avoid horizontal overflow."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add nightlife brand assets under frontend/public/assets/generated and wire logo into Landing Page header plus favicon into HTML.",
      "acceptanceCriteria": [
        "New image assets are added under frontend/public/assets/generated using the exact filenames requested.",
        "Landing page header uses the new logo image asset instead of the current icon-only branding (keep text allowed, but logo must be visible).",
        "frontend/index.html (or equivalent supported mechanism) references the new favicon file so the browser shows the neon favicon."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/logo_full_dark_mode.png.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the required dark-mode brand logo as a static frontend asset (exact filename)."
        },
        {
          "path": "frontend/public/assets/generated/favicon_neon.png.dim_256x256.png",
          "operation": "create",
          "description": "Add the required neon favicon mark as a static frontend asset (exact filename)."
        },
        {
          "path": "frontend/public/assets/generated/placeholder_musician_avatar.dim_512x512.png",
          "operation": "create",
          "description": "Add the required placeholder musician avatar as a static frontend asset."
        },
        {
          "path": "frontend/public/assets/generated/placeholder_venue_cover.dim_1600x900.jpg",
          "operation": "create",
          "description": "Add the required placeholder venue cover image as a static frontend asset."
        },
        {
          "path": "frontend/public/assets/generated/icon_wallet_glow.dim_256x256.png",
          "operation": "create",
          "description": "Add the required wallet glow icon as a static frontend asset."
        },
        {
          "path": "frontend/public/assets/generated/icon_calendar_glow.dim_256x256.png",
          "operation": "create",
          "description": "Add the required calendar glow icon as a static frontend asset."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update the Landing Page header branding to display the new logo image from frontend/public/assets/generated/logo_full_dark_mode.png.dim_1024x1024.png (logo must be visible) while keeping layout responsive and consistent with dark mode."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Reference the new favicon file frontend/public/assets/generated/favicon_neon.png.dim_256x256.png via a supported favicon link tag in the document head so browsers display the neon favicon."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Apply Cyber‑Noir styling tokens to the Landing Page hero (navy/charcoal, white headings, slate body, neon gradient action, subtle glow) while avoiding pure black backgrounds.",
      "acceptanceCriteria": [
        "Landing page hero background uses a dark navy/charcoal feel (not pure black).",
        "Heading text is white and body text uses a slate-muted color in dark mode.",
        "Primary “Book Now” button uses a purple→pink gradient and has a subtle glow (e.g., via drop-shadow/ring/shadow utilities).",
        "No changes are made to immutable hook/component source paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Adjust hero typography and colors to match Cyber‑Noir tokens (white headings, slate-muted body), ensure the hero background reads as deep navy/charcoal (not #000000), and add a subtle glow to the “Book Now” gradient CTA (e.g., using existing Tailwind shadow utilities such as shadow-glow) without touching any immutable paths."
        }
      ]
    }
  ]
}