{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Role selection at login and profile setup",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Persist a pre-login role choice (Venue/Musician/Customer) in the browser session and preselect it during Profile Setup for new users.",
      "acceptanceCriteria": [
        "On the public Landing page, the user can choose one of three options: Venue, Musician, Customer, with clear English labels.",
        "Choosing a role and then logging in persists the selected role for the current browser session (e.g., via sessionStorage) so it survives the Internet Identity redirect/roundtrip.",
        "If the authenticated user has no profile yet and is sent to Profile Setup, the role field is pre-selected to the role chosen on the Landing page.",
        "If no role was selected before login, Profile Setup defaults to the current existing default behavior (musician).",
        "The change does not require editing any files under the frontend immutable paths list (e.g., do not edit `frontend/src/hooks/useInternetIdentity.ts`)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Add role-selection session helpers (e.g., set/get/clear for a single selected-role sessionStorage key) built on the existing sessionStorage utilities so the chosen role survives the Internet Identity roundtrip."
        },
        {
          "path": "frontend/src/components/ProfileSetup.tsx",
          "operation": "modify",
          "description": "Read the persisted selected role on mount and preselect the role RadioGroup accordingly for first-time users; if no stored role exists, keep the current default (musician). Optionally clear the stored role after successful profile creation to avoid stale role carryover within the same session."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "On logout, clear the stored selected-role session parameter (in addition to existing query cache clearing) so role choice does not leak across authenticated sessions in the same browser."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Update Landing page CTAs to provide three distinct role-specific Internet Identity login buttons with consistent loading/disabled behavior.",
      "acceptanceCriteria": [
        "Landing page shows three role-specific login buttons (Venue, Musician, Customer).",
        "Clicking any of the three buttons initiates the existing Internet Identity login flow.",
        "Buttons show an appropriate disabled/loading state when login is in progress, consistent with the current UI behavior.",
        "All user-facing text for these buttons is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Replace/augment existing generic CTAs with three explicit role-specific buttons (Continue/Join as Venue, Musician, Customer). Each button should store the chosen role via the new session helper before calling the existing Internet Identity login() function, and should reflect the current loginStatus disabled/loading state."
        }
      ]
    }
  ]
}